---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Reflectivity
source: html/08d4054f-8223-5612-8c75-8b33db50de65.htm
---
# Autodesk.Revit.DB.ThermalAsset.Reflectivity Property

The reflectivity of the asset.

## Syntax (C#)
```csharp
public double Reflectivity { get; set; }
```

## Remarks
Values must be in the range 0 to 1.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for reflectivity is out of range